Revit 2027 API
MEPConnectorInfo.IsPrimary Property
 True if this is the primary connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPrimary { get; }
Public ReadOnly Property IsPrimary As Boolean
	Get
public:
property bool IsPrimary {
	bool get ();
}
member IsPrimary : bool with get
Property Value
Boolean
See Also
Reference
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace